//3、求一个整数，它加上100后是一个完全平方数，再加上168又是一个完全平方数，
//请问该数时多少 
//(完全平方数是指它是一个整数的平方，例如，2*2=4，则4是完全平方数 


#include <stdio.h>
 int main()
 {
 	int i, j, m, n, x;
 	for (i=1; i < 168 / 2 + 1; i++)   // 根据题意，则有 x+100=m,x+100+168=n,m和n都是完全平方数 
 	{                                 //n-m=168，假设168等于两个数相乘，即i*j=168 
 		if (168 % i == 0)             //那么i和j至少有一个是偶数，假设j是>=2的偶数 
 		{                             //不妨再设i=m1+n1, j=m1-n1,那么m1=（i+j）/2,所以i和j要么都是奇数，要么都是偶数 
 			j=168 / i;                //那么i<168/2+1 
 			if (i > j && (i + j ) % 2 == 0 && (i - j ) % 2 == 0)
 			{
 				m = (i + j) / 2;
 				n = (i - j) / 2;
 				x = n * n - 100;
 				printf ("%d + 100 = %d * %d\n",x,n,n);
 				printf ("%d + 268 = %d * %d\n",x,m,m);
			 }
		 }
	 }
 	
 }
